In [0]:
import pandas as pd
data = {'cities' : ['lahore','karachi',], 'provinces' : ['punjab','sindh']}

In [0]:
frame1 =  pd.DataFrame(data)
display(frame1)

    cities provinces
0   lahore    punjab
1  karachi     sindh

In [0]:
data2 = {"cities": ["islamabad","karachi","peshawar","quetta"],
"provinces": ["capital","sindh", "KPK","Balochistan"]}

In [0]:
frame2 =  pd.DataFrame(data2)
display(frame2)

      cities    provinces
0  islamabad      capital
1    karachi        sindh
2   peshawar          KPK
3     quetta  Balochistan

In [0]:
frame3 = pd.concat([frame1,frame2])
display(frame3)

      cities    provinces
0     lahore       punjab
1    karachi        sindh
0  islamabad      capital
1    karachi        sindh
2   peshawar          KPK
3     quetta  Balochistan

In [0]:
frame3.drop_duplicates().reset_index(drop=True)

      cities    provinces
0     lahore       punjab
1    karachi        sindh
2  islamabad      capital
3   peshawar          KPK
4     quetta  Balochistan

In [0]:
frame3.sort_values(by="provinces").drop_duplicates().reset_index(drop=True)

      cities    provinces
0     quetta  Balochistan
1   peshawar          KPK
2  islamabad      capital
3     lahore       punjab
4    karachi        sindh

In [0]:
StudentDetails= {
    "Name" : ["","Ali","Ahmed","Nida",""],
    "Field" : ["C","E", "E", "C", "C"],
    "Age" : None,
    "Marks" : [-90,60,-10,70,75]
}

In [0]:
student_Dataframe = pd.DataFrame(StudentDetails)
display(student_Dataframe)

    Name Field   Age  Marks
0            C  None    -90
1    Ali     E  None     60
2  Ahmed     E  None    -10
3   Nida     C  None     70
4            C  None     75

In [0]:
student_Dataframe.drop(columns="Age", inplace=True)
display(student_Dataframe)

    Name Field  Marks
0            C    -90
1    Ali     E     60
2  Ahmed     E    -10
3   Nida     C     70
4            C     75

In [0]:
student_Dataframe.Name.replace("","---", inplace=True)
display(student_Dataframe)

    Name Field  Marks
0    ---     C    -90
1    Ali     E     60
2  Ahmed     E    -10
3   Nida     C     70
4    ---     C     75

In [0]:
student_Dataframe.Field.replace(["C","E"],[0,1], inplace=True)
display(student_Dataframe)

    Name  Field  Marks
0    ---      0    -90
1    Ali      1     60
2  Ahmed      1    -10
3   Nida      0     70
4    ---      0     75

In [0]:
student_Dataframe.Marks.where(student_Dataframe.Marks>0 , student_Dataframe.Marks.mean(), inplace=True)
display(student_Dataframe)

    Name  Field  Marks
0    ---      0     21
1    Ali      1     60
2  Ahmed      1     21
3   Nida      0     70
4    ---      0     75